'use strict';
//1// Если переменная a равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = prompt('ведите число');
// a === 0 ? alert('верно') : alert('неверно');
// console.log(a, typeof (a));

// 2// Если переменная a больше нуля, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = prompt('ведите число');
// a > 0 ? alert('верно') : alert('неверно');
// console.log(a, typeof (a));

// 3// Если переменная a меньше нуля, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = prompt('ведите число');
// a <= 0 ? alert('верно') : alert('неверно');

// 4// Если переменная a больше или равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = prompt('ведите число');
// a >= 0 ? alert('верно') : alert('неверно');

// 5// Если переменная a меньше или равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = prompt('ведите число');
// a <= 0 ? alert('верно') : alert('неверно');

// 6 Если переменная a не равна нулю, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = +prompt('ведите число');
// a === !0 ? alert('верно') : alert('неверно');
// console.log(a, typeof (a));

// 7 // Если переменная a равна ‘test’, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = prompt('ведите число');
// a === 'test'? alert('верно') : alert('неверно');
// console.log(a, typeof (a));

// 8 // Если переменная a равна ‘1’ и по значению и по типу, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = prompt('ведите число');
// a === '1' ? alert('верно') : alert('неверно');

// 9 Если переменная a больше нуля и меньше 5-ти, то выведите ‘Верно’, иначе выведите ‘Неверно’.
// let a = prompt('ведите число');
// a > 0 && a < 5 ? alert('верно') : alert('неверно');console.log(a, typeof (a));

// 10 // Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной на экран.
// let a = +prompt('ведите число');
// a === 0 || a === 2 ? alert(a + 7) : alert(a / 10);

// 11 // Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных,иначе выведите их разность (результат вычитания).

// let a = +prompt('ведите число a');
// let b = +prompt('ведите число b')
// a <= 1 || b >= 3 ? alert(a + b) : alert(a - b);

// 12 // Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите ‘Верно’, в противном случае выведите ‘Неверно’.

// let a = +prompt('ведите число a');
// let b = +prompt('ведите число b')
// a > 2 && a < 11 || b >= 6 && b < 14 ? alert('верно') : alert('неверно');

// 13 // Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение ‘1’, то в переменную result запишем ‘зима’, если имеет значение ‘2’ – ‘весна’ и так далее. Решите задачу через switch-case.
// let num = prompt('ведите число 1-4');
// switch (num) {
//     case '1':
//         alert('winter')
//         break
//     case '2':
//         alert('spring')
//         break
//     case '3':
//         alert('summer')
//         break
//     case '4':
//         alert('autumn');
//         break
//     default:
//         alert('упс')
// }
// let result = num
// console.log(result , typeof (result ))