'use strict';
// Переделайте приведенный код так, чтобы в нем использовались операции +=, -=, *=, /=, ++, —.
// Количество строк кода при этом не должно измениться.
//1
let num = 1;

//2
// num = num + 12; //условие
num += 12 // ответ

// 3
// num = num - 14; //условие
num -= 14 //ответ

// 4
// num = num * 5;//условие
num *= 5 //ответ

// 5
// num = num / 7;//условие
num /= 7  //ответ

// 6
// num = num + 1;//условие
num ++  //ответ

// 7
// num = num - 1;//условие
num -- //ответ

// result
alert(num);
console.log(num)